In [87]:
import pandas as pd
import numpy as np
import seaborn as sns

In [88]:
df = pd.read_csv('profesi.csv', delimiter='|')
df['occupation'].nunique()

21

In [89]:
list(df['occupation'].unique())

['technician',
 'other',
 'writer',
 'executive',
 'administrator',
 'student',
 'lawyer',
 'educator',
 'scientist',
 'entertainment',
 'programmer',
 'librarian',
 'homemaker',
 'artist',
 'engineer',
 'marketing',
 'none',
 'healthcare',
 'retired',
 'salesman',
 'doctor']

In [90]:
df['max'] = df['age'].max()
pd.crosstab([df['occupation'],df['gender']],df['max'])

max                    73
occupation    gender
administrator F        36
              M        43
artist        F        13
              M        15
doctor        M         7
educator      F        26
              M        69
engineer      F         2
              M        65
entertainment F         2
              M        16
executive     F         3
              M        29
healthcare    F        11
              M         5
homemaker     F         6
              M         1
lawyer        F         2
              M        10
librarian     F        29
              M        22
marketing     F        10
              M        16
none          F         4
              M         5
other         F        36
              M        69
programmer    F         6
              M        60
retired       F         1
              M        13
salesman      F         3
              M         9
scientist     F         3
              M        28
student       F        60
              M       136
technician    F         1
              M        26
writer        F        19
              M        26

In [92]:
df=sns.load_dataset('tips')
pd.crosstab(index='')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]